/*Задайте массив, заполненный случайными числами. Найдите сумму элементов, стоящих 
на нечетных позициях.*/

Console.WriteLine("Hello, World!");
